morfredus/ESP32-Diagnostic/src/main.cpp
// RGB LED pins (modifiable via web interface)
int rgb_led_pin_r = RGB_LED_PIN_R;
int rgb_led_pin_g = RGB_LED_PIN_G;
int rgb_led_pin_b = RGB_LED_PIN_B;

// Sensor and output pins (modifiable via web interface)
int pwm_pin = PWM_PIN;
int buzzer_pin = BUZZER_PIN;
int dht_pin = DHT_PIN;
int light_sensor_pin = LIGHT_SENSOR_PIN;
int distance_trig_pin = DISTANCE_TRIG_PIN;
int distance_echo_pin = DISTANCE_ECHO_PIN;
int motion_sensor_pin = MOTION_SENSOR_PIN;

// SD Card pins (modifiable via web interface)
int sd_miso = SD_MISO;
int sd_mosi = SD_MOSI;
int sd_sclk = SD_SCLK;
int sd_cs = SD_CS;

// Rotary Encoder pins (modifiable via web interface)
int encoder_clk = ENCODER_CLK;
int encoder_dt = ENCODER_DT;
int encoder_sw = ENCODER_SW;

// OLED display settings (from config.h)
uint8_t oledRotation = DEFAULT_OLED_ROTATION;
int oledWidth = SCREEN_WIDTH;
int oledHeight = SCREEN_HEIGHT;

// DHT sensor type (configurable at runtime)
uint8_t DHT_SENSOR_TYPE = DEFAULT_DHT_SENSOR_TYPE;

// ========== OBJETS GLOBAUX ==========
WebServer server(WEB_SERVER_PORT);
WiFiMulti wifiMulti;
#if DIAGNOSTIC_HAS_MDNS
bool mdnsServiceActive = false;
bool wifiPreviouslyConnected = false;
unsigned long lastMDNSAttempt = 0;
bool mdnsLastAttemptFailed = false;
#if defined(DIAGNOSTIC_USES_IDF_MDNS)
bool mdnsResponderInitialized = false;
#endif
#endif
U8G2_SSD1306_128X64_NONAME_F_HW_I2C oled(U8G2_R0, U8X8_PIN_NONE);


// NeoPixel (from board_config.h via config.h)
int LED_PIN = NEOPIXEL_PIN;
int LED_COUNT = DEFAULT_NEOPIXEL_COUNT;

// TFT pins (modifiables via web)
#if ENABLE_TFT_DISPLAY
int tftMOSI = TFT_MOSI;
int tftSCLK = TFT_SCLK;
int tftCS = TFT_CS;
int tftDC = TFT_DC;
int tftRST = TFT_RST;
int tftBL = TFT_BL;
int tftWidth = TFT_WIDTH;
int tftHeight = TFT_HEIGHT;
int tftRotation = TFT_ROTATION;
#endif
Adafruit_NeoPixel *strip = nullptr;

// NeoPixel heartbeat state
volatile bool neopixelStatusPaused = false;

// SD Card state
bool sdCardAvailable = false;
uint64_t sdCardSize = 0;
uint64_t sdCardUsed = 0;

// Rotary Encoder state
volatile int encoderPosition = 0;
volatile int lastEncoderCLK = HIGH;
volatile bool encoderButtonPressed = false;
volatile unsigned long lastEncoderInterrupt = 0;
const unsigned long ENCODER_DEBOUNCE_MS = 5;
unsigned long neopixelHeartbeatPreviousMillis = 0;
const unsigned long NEOPIXEL_HEARTBEAT_INTERVAL_MS = 1000;
bool neopixelHeartbeatState = false;
bool neopixelStatusKnown = false;
bool neopixelLastWifiConnected = false;
bool neopixelConnecting = false;

// [OPT-004] Constant for repeated test result initialization
static const String DEFAULT_TEST_RESULT_STR = String(Texts::not_tested);
// [OPT-009] Constants for repeated test status strings
static const String OK_STR = String(Texts::ok);
static const String FAIL_STR = String(Texts::fail);

bool neopixelTested = false;
bool neopixelAvailable = false;
bool neopixelSupported = false;
String neopixelTestResult = DEFAULT_TEST_RESULT_STR;

// Forward declarations for NeoPixel functions
void neopixelShowRebootFlash();
void neopixelSetWifiState(bool connected);
void neopixelShowConnecting();
void neopixelPauseStatus();
void neopixelResumeStatus();
void neopixelRestoreWifiStatus();
void updateNeoPixelWifiStatus();

// Forward declarations for SD Card functions
bool initSDCard();
void testSDCard();
uint64_t getSDCardSize();
uint64_t getSDCardUsed();
String getSDCardType();

// Forward declarations for Rotary Encoder functions
void IRAM_ATTR encoderISR();
void IRAM_ATTR encoderButtonISR();
void initEncoder();
int getEncoderPosition();
void resetEncoderPosition();
bool isEncoderButtonPressed();

// Built-in LED (from config.h)
int BUILTIN_LED_PIN = DEFAULT_BUILTIN_LED_PIN;
bool builtinLedTested = false;
bool builtinLedAvailable = false;
String builtinLedTestResult = DEFAULT_TEST_RESULT_STR;

bool oledTested = false;
bool oledAvailable = false;
String oledTestResult = DEFAULT_TEST_RESULT_STR;

#if ENABLE_TFT_DISPLAY
String tftTestResult = DEFAULT_TEST_RESULT_STR;
#endif

// Exécution asynchrone des tests matériels
typedef void (*TestRoutine)();

struct AsyncTestRunner {
  const char* taskName;
  TaskHandle_t taskHandle;
  volatile bool running;
};

struct AsyncTestTaskArgs {
  AsyncTestRunner* runner;
  TestRoutine routine;
};

static void asyncTestTask(void* parameters) {
  AsyncTestTaskArgs* args = static_cast<AsyncTestTaskArgs*>(parameters);
  if (args && args->routine) {
    args->routine();
  }
  if (args) {
    if (args->runner) {
      args->runner->running = false;
      args->runner->taskHandle = nullptr;
    }
    delete args;
  }
  vTaskDelete(nullptr);
}

static bool startAsyncTest(AsyncTestRunner& runner,
                           TestRoutine routine,
                           bool& alreadyRunning,
                           uint32_t stackSize = 4096,
                           UBaseType_t priority = 1) {
  alreadyRunning = runner.running;
  if (runner.running) {
    return false;
  }

  AsyncTestTaskArgs* args = new AsyncTestTaskArgs{&runner, routine};
  runner.running = true;

#if CONFIG_FREERTOS_UNICORE
  const BaseType_t targetCore = tskNO_AFFINITY;
#else
  const BaseType_t targetCore = 1;
#endif

  BaseType_t result = xTaskCreatePinnedToCore(asyncTestTask,
                                              runner.taskName,
                                              stackSize,
                                              args,
                                              priority,
                                              &runner.taskHandle,
                                              targetCore);
  if (result != pdPASS) {
    runner.running = false;
    runner.taskHandle = nullptr;
    delete args;
    alreadyRunning = false;
    return false;
  }

  alreadyRunning = false;
  return true;
}

// Orchestrateurs asynchrones des tests lents
static AsyncTestRunner builtinLedTestRunner = {"BuiltinLEDTest", nullptr, false};
static AsyncTestRunner neopixelTestRunner = {"NeoPixelTest", nullptr, false};
static AsyncTestRunner oledTestRunner = {"OLEDTest", nullptr, false};
static AsyncTestRunner rgbLedTestRunner = {"RgbLedTest", nullptr, false};
static AsyncTestRunner buzzerTestRunner = {"BuzzerTest", nullptr, false};

