morfredus/ESP32-Diagnostic/src/main.cpp
void neopixelChase() {
  if (!strip) return;
  uint32_t colors[] = {
    strip->Color(255, 0, 0),
    strip->Color(0, 255, 0),
    strip->Color(0, 0, 255),
    strip->Color(255, 255, 0),
    strip->Color(255, 0, 255),
    strip->Color(0, 255, 255)
  };
  int numColors = sizeof(colors) / sizeof(colors[0]);

  for (int cycle = 0; cycle < 3; cycle++) {
    for (int colorIndex = 0; colorIndex < numColors; colorIndex++) {
      for (int pos = 0; pos < LED_COUNT; pos++) {
        strip->clear();
        for (int i = 0; i < LED_COUNT; i++) {
          if ((i + pos) % 3 == 0) {
            strip->setPixelColor(i, colors[colorIndex]);
          }
        }
        strip->show();
        delay(100);
      }
    }
  }
  strip->clear();
  strip->show();
}

void applyOLEDOrientation() {
  const u8g2_cb_t *rotation = U8G2_R0;
  switch(oledRotation & 0x03) {
    case 0: rotation = U8G2_R0; break;
    case 1: rotation = U8G2_R1; break;
    case 2: rotation = U8G2_R2; break;
    case 3: rotation = U8G2_R3; break;
  }
  oled.setDisplayRotation(rotation);
}

void detectOLED() {
  Serial.println("\r\n=== DETECTION OLED ===");
  ensureI2CBusConfigured();
  Serial.printf("I2C: SDA=%d, SCL=%d\r\n", i2c_sda, i2c_scl);

  Wire.beginTransmission(SCREEN_ADDRESS);
  bool i2cDetected = (Wire.endTransmission() == 0);

  if(i2cDetected && oled.begin()) {
    oledAvailable = true;
    applyOLEDOrientation();
    oledTestResult = String(Texts::detected) + " @ 0x" + String(SCREEN_ADDRESS, HEX);
    Serial.println("OLED: Detecte!\r\n");
  } else {
    oledAvailable = false;
    if (i2cDetected) {
      // [OPT-009]: Buffer-based fail message (1 vs 2 allocations)
      char failBuf[96];
      snprintf(failBuf, sizeof(failBuf), "%s - %s", Texts::i2c_peripherals.str().c_str(), Texts::fail.str().c_str());
      oledTestResult = String(failBuf);
    } else {
      // [OPT-009]: Buffer-based not_detected message (1 vs 4 allocations)
      char notDetBuf[128];
      snprintf(notDetBuf, sizeof(notDetBuf), "%s (SDA:%d SCL:%d)", Texts::not_detected.str().c_str(), i2c_sda, i2c_scl);
      oledTestResult = String(notDetBuf);
    }
    Serial.println("OLED: Non detecte\r\n");
  }
}

void oledStepWelcome() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, "TEST OLED 0.96\"");
  oled.drawStr(0, 30, "128x64 pixels");
  char buf[32];
  snprintf(buf, sizeof(buf), "I2C: 0x%02X", SCREEN_ADDRESS);
  oled.drawStr(0, 45, buf);
  snprintf(buf, sizeof(buf), "SDA:%d SCL:%d", i2c_sda, i2c_scl);
  oled.drawStr(0, 60, buf);
  oled.sendBuffer();
  delay(700);
}

void oledStepBigText() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_ncenB14_tr);
  oled.drawStr(20, 35, "ESP32");
  oled.sendBuffer();
  delay(450);
}

void oledStepTextSizes() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 10, "Taille 1");
  oled.setFont(u8g2_font_ncenB14_tr);
  oled.drawStr(0, 30, "Taille 2");
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(0, 50, "Retour taille 1");
  oled.sendBuffer();
  delay(550);
}

void oledStepShapes() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.drawFrame(10, 10, 30, 20);
  oled.drawBox(50, 10, 30, 20);
  oled.drawCircle(25, 50, 10);
  oled.drawDisc(65, 50, 10);
  oled.drawTriangle(95, 30, 85, 10, 105, 10);
  oled.sendBuffer();
  delay(550);
}

void oledStepHorizontalLines() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  for (int i = 0; i < SCREEN_HEIGHT; i += 4) {
    oled.drawLine(0, i, SCREEN_WIDTH - 1, i);
  }
  oled.sendBuffer();
  delay(350);
}

void oledStepDiagonals() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  for (int i = 0; i < SCREEN_WIDTH; i += 8) {
    oled.drawLine(0, 0, i, SCREEN_HEIGHT - 1);
    oled.drawLine(SCREEN_WIDTH - 1, 0, i, SCREEN_HEIGHT - 1);
  }
  oled.sendBuffer();
  delay(350);
}

void oledStepMovingSquare() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  for (int x = 0; x < SCREEN_WIDTH - 20; x += 6) {
    oled.clearBuffer();
    oled.drawBox(x, 22, 20, 20);
    oled.sendBuffer();
    delay(12);
    yield();
  }
}

void oledStepProgressBar() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  String loadingText = String(Texts::loading);
  oled.drawStr(20, 15, loadingText.c_str());
  oled.sendBuffer();

  for (int i = 0; i <= 100; i += 10) {
    oled.clearBuffer();
    oled.setFont(u8g2_font_6x10_tf);
    oled.drawStr(20, 15, loadingText.c_str());
    oled.drawFrame(10, 30, 108, 15);
    oled.drawBox(12, 32, i, 11);
    char buf[8];
    snprintf(buf, sizeof(buf), "%d%%", i);
    oled.drawStr(45, 55, buf);
    oled.sendBuffer();
    delay(45);
    yield();
  }
  delay(300);
}

void oledStepScrollText() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  String scrollText = "  DIAGNOSTIC ESP32 COMPLET - OLED 0.96 pouces I2C  ";
  int textWidth = scrollText.length() * 6;
  for (int offset = 0; offset < textWidth; offset += 6) {
    oled.clearBuffer();
    oled.setFont(u8g2_font_6x10_tf);
    oled.setCursor(-offset, 35);
    oled.print(scrollText);
    oled.sendBuffer();
    delay(12);
    yield();
  }
}

void oledStepFinalMessage() {
  if (!oledAvailable) return;
  applyOLEDOrientation();
  oled.clearBuffer();
  oled.setFont(u8g2_font_6x10_tf);
  oled.drawStr(30, 30, "TEST OK!");
  oled.drawFrame(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT);
  oled.sendBuffer();
  delay(600);
  oled.clearBuffer();
  oled.sendBuffer();
}

bool performOLEDStep(const String &stepId) {
  if (!oledAvailable) {
    return false;
  }

  if (stepId == "welcome") {
    oledStepWelcome();
  } else if (stepId == "big_text") {
    oledStepBigText();
  } else if (stepId == "text_sizes") {
    oledStepTextSizes();
  } else if (stepId == "shapes") {
    oledStepShapes();
  } else if (stepId == "horizontal_lines") {
    oledStepHorizontalLines();
  } else if (stepId == "diagonals") {
    oledStepDiagonals();
  } else if (stepId == "moving_square") {
    oledStepMovingSquare();
  } else if (stepId == "progress_bar") {
    oledStepProgressBar();
  } else if (stepId == "scroll_text") {
    oledStepScrollText();
  } else if (stepId == "final_message") {
    oledStepFinalMessage();
  } else {
    return false;
  }

