morfredus/ESP32-Diagnostic/src/main.cpp
  delay(500);
#endif
}

void tftStepFinal() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) return;
  
  tft.fillScreen(TFT_BLACK);
  
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(3);
  tft.setCursor(40, 80);
  tft.println("TEST");
  tft.setCursor(20, 120);
  tft.println("COMPLETE!");
  
  // Success indicator
  tft.fillCircle(120, 180, 20, TFT_GREEN);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(3);
  tft.setCursor(108, 172);
  tft.print("OK");
  
  delay(2000);
#endif
}

bool performTFTStep(const String &stepId) {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    return false;
  }

  if (stepId == "boot") {
    tftStepBoot();
  } else if (stepId == "colors") {
    tftStepColors();
  } else if (stepId == "shapes") {
    tftStepShapes();
  } else if (stepId == "text") {
    tftStepText();
  } else if (stepId == "lines") {
    tftStepLines();
  } else if (stepId == "animation") {
    tftStepAnimation();
  } else if (stepId == "progress") {
    tftStepProgressBar();
  } else if (stepId == "final") {
    tftStepFinal();
  } else {
    return false;
  }

  return true;
#else
  return false;
#endif
}

String getTFTStepLabel(const String &stepId) {
  if (stepId == "boot") return "Boot Screen";
  if (stepId == "colors") return "Colors";
  if (stepId == "shapes") return "Shapes";
  if (stepId == "text") return "Text";
  if (stepId == "lines") return "Lines";
  if (stepId == "animation") return "Animation";
  if (stepId == "progress") return "Progress Bar";
  if (stepId == "final") return "Final Message";
  return stepId;
}

void testTFT() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    tftTestResult = String(Texts::not_available);
    return;
  }

  Serial.println("\r\n=== TEST TFT ===");

  tftStepBoot();
  tftStepColors();
  tftStepShapes();
  tftStepText();
  tftStepLines();
  tftStepAnimation();
  tftStepProgressBar();
  tftStepFinal();

  tftTestResult = "OK - Tests complets";
  Serial.println("TFT: Tests complets OK\r\n");
#endif
}

// ========== TEST ADC ==========
void testADC() {
  Serial.println("\r\n=== TEST ADC ===");
  adcReadings.clear();
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    int adcPins[] = {36, 39, 34, 35, 32, 33};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    int adcPins[] = {1, 2, 3, 4, 5, 6};
    int numADC = 6;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    int adcPins[] = {0, 1, 2, 3, 4};
    int numADC = 5;
  #else
    int adcPins[] = {36, 39};
    int numADC = 2;
  #endif

  for (int i = 0; i < numADC; i++) {
    ADCReading reading;
    reading.pin = adcPins[i];
    reading.rawValue = analogRead(adcPins[i]);
    reading.voltage = (reading.rawValue / 4095.0) * 3.3;
    adcReadings.push_back(reading);

    Serial.printf("GPIO%d: %d (%.2fV)\r\n", reading.pin, reading.rawValue, reading.voltage);
  }
  
  // [OPT-009]: Buffer-based test result (1 vs 4 allocations)
  char adcBuf[96];
  snprintf(adcBuf, sizeof(adcBuf), "%d %s - %s", numADC, Texts::channels.str().c_str(), Texts::ok.str().c_str());
  adcTestResult = String(adcBuf);
  Serial.printf("ADC: %d canaux testes\r\n", numADC);
}

// ========== TEST PWM ==========
void testPWM() {
  Serial.println("\r\n=== TEST PWM ===");
  int testPin = 2;

  #ifdef CONFIG_IDF_TARGET_ESP32S3
    testPin = 48;
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    testPin = 8;
  #endif

  Serial.printf("Test PWM sur GPIO%d\r\n", testPin);

  // --- [PLATFORMIO FIX] Use legacy LEDC API for PlatformIO compatibility ---
  uint8_t pwmChannel = 0;
  ledcSetup(pwmChannel, 5000, 8);       // channel, freq, resolution
  ledcAttachPin(testPin, pwmChannel);    // pin, channel

  for (int duty = 0; duty <= 255; duty += 51) {
    ledcWrite(pwmChannel, duty);         // channel, duty
    Serial.printf("PWM duty: %d/255\r\n", duty);
    delay(80);
    yield();
  }

  ledcWrite(pwmChannel, 0);
  ledcDetachPin(testPin);                // pin

  // [OPT-009]: Buffer-based test result (1 vs 4 allocations)
  char pwmBuf[96];
  snprintf(pwmBuf, sizeof(pwmBuf), "%s %s - GPIO %d", Texts::test.str().c_str(), Texts::ok.str().c_str(), testPin);
  pwmTestResult = String(pwmBuf);
  Serial.println("PWM: OK");
}

// ========== SCAN SPI ==========
void scanSPI() {
  Serial.println("\r\n=== SCAN SPI ===");
  spiInfo = "";
  
  #ifdef CONFIG_IDF_TARGET_ESP32
    spiInfo = "HSPI (12,13,14,15), VSPI (18,19,23,5)";
    Serial.println("SPI: HSPI + VSPI disponibles");
  #elif defined(CONFIG_IDF_TARGET_ESP32S2)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32S3)
    spiInfo = "SPI2, SPI3 disponibles";
    Serial.println("SPI: SPI2, SPI3");
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    spiInfo = "SPI2 disponible";
    Serial.println("SPI: SPI2");
  #else
    spiInfo = "Info SPI non disponible";
  #endif
}

// ========== SD CARD ==========
bool initSDCard() {
  Serial.println("\r\n=== INITIALISATION CARTE SD ===");

  // Initialize SPI for SD Card
  SPI.begin(sd_sclk, sd_miso, sd_mosi, sd_cs);

  // Try to mount SD card
  if (!SD.begin(sd_cs)) {
    Serial.println("Échec du montage de la carte SD");
    sdCardAvailable = false;
    return false;
  }

  uint8_t cardType = SD.cardType();
  if (cardType == CARD_NONE) {
    Serial.println("Aucune carte SD détectée");
    sdCardAvailable = false;
    return false;
  }

  sdCardAvailable = true;
  sdCardSize = SD.cardSize() / (1024 * 1024);
  sdCardUsed = SD.usedBytes() / (1024 * 1024);

  Serial.print("Type de carte SD: ");
  Serial.println(getSDCardType());
  Serial.print("Taille: ");
  Serial.print(sdCardSize);
  Serial.println(" MB");
  Serial.print("Utilisé: ");
  Serial.print(sdCardUsed);
  Serial.println(" MB");

  return true;
}

void testSDCard() {
  Serial.println("\r\n=== TEST CARTE SD ===");

  if (!sdCardAvailable) {
    Serial.println("Carte SD non disponible");
    return;
  }

  // Test write
  File testFile = SD.open("/test.txt", FILE_WRITE);
  if (!testFile) {
    Serial.println("Échec de création du fichier test");
    return;
  }

  testFile.println("ESP32 Diagnostic Suite - SD Card Test");
  testFile.close();
  Serial.println("Écriture du fichier test OK");

