morfredus/ESP32-Diagnostic/src/main.cpp
  // Test read
  testFile = SD.open("/test.txt");
  if (!testFile) {
    Serial.println("Échec de lecture du fichier test");
    return;
  }

  Serial.println("Contenu du fichier test:");
  while (testFile.available()) {
    Serial.write(testFile.read());
  }
  testFile.close();

  // Test delete
  if (SD.remove("/test.txt")) {
    Serial.println("Suppression du fichier test OK");
  } else {
    Serial.println("Échec de suppression du fichier test");
  }
}

uint64_t getSDCardSize() {
  if (!sdCardAvailable) return 0;
  return SD.cardSize() / (1024 * 1024);
}

uint64_t getSDCardUsed() {
  if (!sdCardAvailable) return 0;
  return SD.usedBytes() / (1024 * 1024);
}

String getSDCardType() {
  if (!sdCardAvailable) return "None";

  uint8_t cardType = SD.cardType();
  switch (cardType) {
    case CARD_MMC:
      return "MMC";
    case CARD_SD:
      return "SDSC";
    case CARD_SDHC:
      return "SDHC";
    default:
      return "Unknown";
  }
}

// ========== ROTARY ENCODER ==========
void IRAM_ATTR encoderISR() {
  unsigned long currentTime = millis();
  if (currentTime - lastEncoderInterrupt < ENCODER_DEBOUNCE_MS) {
    return;
  }

  int clkValue = digitalRead(encoder_clk);
  int dtValue = digitalRead(encoder_dt);

  if (clkValue != lastEncoderCLK) {
    if (dtValue != clkValue) {
      encoderPosition++;
    } else {
      encoderPosition--;
    }
    lastEncoderInterrupt = currentTime;
  }
  lastEncoderCLK = clkValue;
}

void IRAM_ATTR encoderButtonISR() {
  unsigned long currentTime = millis();
  if (currentTime - lastEncoderInterrupt < ENCODER_DEBOUNCE_MS) {
    return;
  }

  encoderButtonPressed = !digitalRead(encoder_sw);
  lastEncoderInterrupt = currentTime;
}

void initEncoder() {
  Serial.println("\r\n=== INITIALISATION ENCODEUR ROTATIF ===");

  pinMode(encoder_clk, INPUT_PULLUP);
  pinMode(encoder_dt, INPUT_PULLUP);
  pinMode(encoder_sw, INPUT_PULLUP);

  lastEncoderCLK = digitalRead(encoder_clk);

  attachInterrupt(digitalPinToInterrupt(encoder_clk), encoderISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoder_sw), encoderButtonISR, CHANGE);

  Serial.println("Encodeur rotatif initialisé");
  Serial.print("CLK: GPIO ");
  Serial.println(encoder_clk);
  Serial.print("DT: GPIO ");
  Serial.println(encoder_dt);
  Serial.print("SW: GPIO ");
  Serial.println(encoder_sw);
}

int getEncoderPosition() {
  return encoderPosition;
}

void resetEncoderPosition() {
  encoderPosition = 0;
}

bool isEncoderButtonPressed() {
  return encoderButtonPressed;
}

// ========== LISTING PARTITIONS ==========
void listPartitions() {
  Serial.println("\r\n=== PARTITIONS FLASH ===");
  partitionsInfo = "";

  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  
  int count = 0;
  while (it != NULL) {
    const esp_partition_t *part = esp_partition_get(it);
    
    char line[128];
    sprintf(line, "%s - Type:0x%02x Addr:0x%08x Size:%dKB", 
            part->label, part->type, part->address, part->size / 1024);
    
    if (count > 0) partitionsInfo += "\r\n";
    partitionsInfo += String(line);
    
    Serial.println(line);
    
    it = esp_partition_next(it);
    count++;
  }
  
  esp_partition_iterator_release(it);
  Serial.printf("Total: %d partitions\r\n", count);
}

// TEST LED RGB
void testRGBLed() {
  Serial.println("\r\n=== TEST LED RGB ===");

  if (rgb_led_pin_r < 0 || rgb_led_pin_g < 0 || rgb_led_pin_b < 0) {
    rgbLedTestResult = String(Texts::configuration_invalid);
    rgbLedAvailable = false;
    Serial.println("LED RGB: Configuration invalide");
    return;
  }

  pinMode(rgb_led_pin_r, OUTPUT);
  pinMode(rgb_led_pin_g, OUTPUT);
  pinMode(rgb_led_pin_b, OUTPUT);

  Serial.printf("Test LED RGB - R:%d G:%d B:%d\r\n", rgb_led_pin_r, rgb_led_pin_g, rgb_led_pin_b);

  digitalWrite(rgb_led_pin_r, LOW);
  digitalWrite(rgb_led_pin_g, LOW);
  digitalWrite(rgb_led_pin_b, LOW);
  delay(120);

  digitalWrite(rgb_led_pin_r, HIGH);
  delay(150);
  digitalWrite(rgb_led_pin_r, LOW);

  digitalWrite(rgb_led_pin_g, HIGH);
  delay(150);
  digitalWrite(rgb_led_pin_g, LOW);

  digitalWrite(rgb_led_pin_b, HIGH);
  delay(150);
  digitalWrite(rgb_led_pin_b, LOW);

  rgbLedTestResult = OK_STR;
  rgbLedAvailable = true;
  Serial.println("LED RGB: OK");
}

void setRGBLedColor(int r, int g, int b) {
  if (rgb_led_pin_r >= 0 && rgb_led_pin_g >= 0 && rgb_led_pin_b >= 0) {
    analogWrite(rgb_led_pin_r, r);
    analogWrite(rgb_led_pin_g, g);
    analogWrite(rgb_led_pin_b, b);
  }
}

// TEST BUZZER
void testBuzzer() {
  Serial.println("\r\n=== TEST BUZZER ===");

  if (buzzer_pin < 0) {
    buzzerTestResult = String(Texts::configuration_invalid);
    buzzerAvailable = false;
    Serial.println("Buzzer: Configuration invalide");
    return;
  }

  pinMode(buzzer_pin, OUTPUT);
  Serial.printf("Test Buzzer - Pin:%d\r\n", buzzer_pin);

  tone(buzzer_pin, 1000, 160);
  delay(220);
  tone(buzzer_pin, 1500, 160);
  delay(220);
  tone(buzzer_pin, 2000, 160);
  delay(220);
  noTone(buzzer_pin);

  buzzerTestResult = OK_STR;
  buzzerAvailable = true;
  Serial.println("Buzzer: OK");
}

void playBuzzerTone(int frequency, int duration) {
  if (BUZZER_PIN >= 0) {
    tone(buzzer_pin, frequency, duration);
  }
}

// DHT sensor helpers
static inline const char* getDhtSensorName() {
  return (DHT_SENSOR_TYPE == 22) ? "DHT22" : "DHT11";
}

// TEST DHT SENSOR
void testDHTSensor() {
  const char* sensorName = getDhtSensorName();
  Serial.printf("\r\n=== TEST %s ===\r\n", sensorName);

  if (dht_pin < 0) {
    dhtTestResult = String(Texts::configuration_invalid);
    dhtAvailable = false;
    Serial.printf("%s: Configuration invalide\r\n", sensorName);
    return;
  }

  Serial.printf("Lecture %s - Pin:%d\r\n", sensorName, dht_pin);

  pinMode(dht_pin, OUTPUT);
  digitalWrite(dht_pin, LOW);
  delay(20);
  digitalWrite(dht_pin, HIGH);
  delayMicroseconds(40);
  pinMode(dht_pin, INPUT_PULLUP);

  uint8_t data[5] = {0};
  uint8_t bits[40] = {0};

  unsigned long timeout = millis();
  while (digitalRead(dht_pin) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(dht_pin) == LOW) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(dht_pin) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  for (int i = 0; i < 40; i++) {
    timeout = micros();
    while (digitalRead(dht_pin) == LOW) {
      if (micros() - timeout > 100) break;
    }

    unsigned long t = micros();
    timeout = micros();
    while (digitalRead(dht_pin) == HIGH) {
      if (micros() - timeout > 100) break;
    }

