morfredus/ESP32-Diagnostic/src/main.cpp
    if ((micros() - t) > 40) {
      bits[i] = 1;
    }
  }

  for (int i = 0; i < 5; i++) {
    data[i] = 0;
    for (int j = 0; j < 8; j++) {
      data[i] <<= 1;
      data[i] |= bits[i * 8 + j];
    }
  }

  if (data[4] == ((data[0] + data[1] + data[2] + data[3]) & 0xFF)) {
    if (DHT_SENSOR_TYPE == 22) {
      uint16_t rawHumidity = (static_cast<uint16_t>(data[0]) << 8) | data[1];
      uint16_t rawTemperature = (static_cast<uint16_t>(data[2]) << 8) | data[3];
      bool negative = rawTemperature & 0x8000;
      if (negative) {
        rawTemperature &= 0x7FFF;
      }
      dhtHumidity = rawHumidity * 0.1f;
      dhtTemperature = rawTemperature * 0.1f;
      if (negative) {
        dhtTemperature = -dhtTemperature;
      }
    } else {
      dhtHumidity = static_cast<float>(data[0]) + static_cast<float>(data[1]) * 0.1f;
      dhtTemperature = static_cast<float>(data[2]) + static_cast<float>(data[3]) * 0.1f;
    }
    dhtTestResult = OK_STR;
    dhtAvailable = true;
    Serial.printf("%s: T=%.1f°C H=%.1f%%\r\n", sensorName, dhtTemperature, dhtHumidity);
  } else {
    dhtTestResult = String(Texts::error_label);
    dhtAvailable = false;
    Serial.printf("%s: Checksum error\r\n", sensorName);
  }
}

// TEST LIGHT SENSOR
void testLightSensor() {
  Serial.println("\r\n=== TEST LIGHT SENSOR ===");

  if (light_sensor_pin < 0) {
    lightSensorTestResult = String(Texts::configuration_invalid);
    lightSensorAvailable = false;
    Serial.println("Light Sensor: Configuration invalide");
    return;
  }

  pinMode(light_sensor_pin, INPUT);
  Serial.printf("Lecture Light Sensor - Pin:%d\r\n", light_sensor_pin);

  int sum = 0;
  const int samples = 6;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(light_sensor_pin);
    delay(8);
    yield();
  }
  lightSensorValue = sum / samples;

  lightSensorTestResult = OK_STR;
  lightSensorAvailable = true;
  Serial.printf("Light Sensor: %d\r\n", lightSensorValue);
}

// TEST DISTANCE SENSOR
void testDistanceSensor() {
  Serial.println("\r\n=== TEST DISTANCE SENSOR (HC-SR04) ===");

  if (distance_trig_pin < 0 || distance_echo_pin < 0) {
    distanceSensorTestResult = String(Texts::configuration_invalid);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: Configuration invalide");
    return;
  }

  // ESP32-S3 (OPI Flash/PSRAM): GPIO 35..48 sont généralement réservées
  // Si utilisées pour TRIG/ECHO, la mesure échouera systématiquement
  if ((distance_trig_pin >= 35 && distance_trig_pin <= 48) ||
      (distance_echo_pin >= 35 && distance_echo_pin <= 48)) {
    distanceSensorTestResult = String(Texts::configuration_invalid);
    distanceSensorAvailable = false;
    Serial.printf("Distance Sensor: Pins invalides sur ESP32-S3 OPI (TRIG=%d, ECHO=%d). Evitez GPIO 35..48.\r\n",
                  distance_trig_pin, distance_echo_pin);
    Serial.println("Suggestion: TRIG=26 (sortie), ECHO=25 (entrée) si le bus I2C secondaire est inactif.");
    return;
  }

  pinMode(distance_trig_pin, OUTPUT);
  pinMode(distance_echo_pin, INPUT);

  Serial.printf("Distance Sensor - Trig:%d Echo:%d\r\n", distance_trig_pin, distance_echo_pin);

  // Assurer ECHO à LOW avant de déclencher (éviter faux négatifs)
  {
    unsigned long waitStart = micros();
    while (digitalRead(distance_echo_pin) == HIGH && (micros() - waitStart) < 200000UL) {
      yield();
    }
  }

  // Séquence TRIG: 10 µs HIGH après stabilisation LOW
  digitalWrite(distance_trig_pin, LOW);
  delayMicroseconds(4);
  digitalWrite(distance_trig_pin, HIGH);
  delayMicroseconds(10);
  digitalWrite(distance_trig_pin, LOW);

  // Mesure de l'impulsion ECHO (timeout élargi)
  unsigned long timeoutUs = 60000UL; // 60 ms
  unsigned long duration = 0UL;
#if defined(ARDUINO_ARCH_ESP32)
  duration = pulseInLong(distance_echo_pin, HIGH, timeoutUs);
#else
  duration = pulseIn(distance_echo_pin, HIGH, timeoutUs);
#endif

  if (duration > 0UL) {
    // Vitesse du son ~0.034 cm/µs ; aller-retour => /2
    distanceValue = (double)duration * 0.034 / 2.0;
    distanceSensorTestResult = OK_STR;
    distanceSensorAvailable = true;
    Serial.printf("Distance: %.2f cm\r\n", distanceValue);
  } else {
    distanceSensorTestResult = String(Texts::error_label);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: No echo (check wiring/level shifting/target distance)");
  }
}

// TEST MOTION SENSOR
void testMotionSensor() {
  Serial.println("\r\n=== TEST MOTION SENSOR (PIR) ===");

  if (motion_sensor_pin < 0) {
    motionSensorTestResult = String(Texts::configuration_invalid);
    motionSensorAvailable = false;
    Serial.println("Motion Sensor: Configuration invalide");
    return;
  }

  pinMode(motion_sensor_pin, INPUT);
  Serial.printf("Motion Sensor - Pin:%d\r\n", motion_sensor_pin);

  delay(30);
  yield();
  motionDetected = digitalRead(motion_sensor_pin);

  motionSensorTestResult = OK_STR;
  motionSensorAvailable = true;
  Serial.printf("Motion: %s\r\n", motionDetected ? "Detected" : "None");
}

// ========== TEST STRESS MÉMOIRE ==========
void memoryStressTest() {
  Serial.println("\r\n=== STRESS TEST MEMOIRE ===");
  
  unsigned long startMs = millis();
  stressAllocationCount = 0;
  stressDurationMs = 0;

  const int allocSize = 1024;
  int maxAllocs = 0;
  std::vector<void*> allocations;
  
  Serial.println("Allocation progressive...");
  while(true) {
    void* ptr = malloc(allocSize);
    if (!ptr) break;
    allocations.push_back(ptr);
    maxAllocs++;
    
    if (maxAllocs % 100 == 0) {
      Serial.printf("Alloue: %d KB\r\n", maxAllocs);
    }
  }
  
  Serial.printf("Max allocations: %d blocs (%d KB)\r\n", maxAllocs, maxAllocs);


  Serial.println("Liberation memoire...");
  for (auto ptr : allocations) {
    free(ptr);
  }

  stressAllocationCount = maxAllocs;
  stressDurationMs = millis() - startMs;

  stressTestResult = String(Texts::max_alloc) + ": " + String(maxAllocs) + " KB";
  Serial.println("Stress test: OK");
}

// ========== COLLECTE DONNÉES ==========
void collectDiagnosticInfo() {
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  
  diagnosticData.chipModel = detectChipModel();
  diagnosticData.chipRevision = String(chip_info.revision);
  diagnosticData.cpuCores = chip_info.cores;
  diagnosticData.cpuFreqMHz = ESP.getCpuFreqMHz();
  
  uint32_t flash_size;
  esp_flash_get_size(NULL, &flash_size);
  diagnosticData.flashSize = flash_size;
  diagnosticData.psramSize = ESP.getPsramSize();
  
