morfredus/ESP32-Diagnostic/src/main.cpp
  sendOperationSuccess(message);
}

void handleNeoPixelConfig() {
  if (server.hasArg("gpio") && server.hasArg("count")) {
    int newGPIO = server.arg("gpio").toInt();
    int newCount = server.arg("count").toInt();
    
    if (newGPIO >= 0 && newGPIO <= 48 && newCount > 0 && newCount <= 100) {
      LED_PIN = newGPIO;
      LED_COUNT = newCount;
      if (strip) delete strip;
      strip = new Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
      resetNeoPixelTest();
      // [OPT-007]: Buffer-based message formatting (1 vs 4 allocations)
      char msgBuf[96];
      snprintf(msgBuf, sizeof(msgBuf), "%s %s %d", Texts::config.str().c_str(), Texts::gpio.str().c_str(), LED_PIN);
      sendOperationSuccess(String(msgBuf));
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
}

void handleNeoPixelTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(neopixelTestRunner, runNeopixelTestTask, alreadyRunning);

  if (started) {
    sendActionResponse(202, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", neopixelAvailable),
      jsonStringField("result", neopixelTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", neopixelAvailable),
      jsonStringField("result", neopixelTestResult)
    });
    return;
  }

  neopixelPauseStatus();
  resetNeoPixelTest();
  testNeoPixel();
  neopixelRestoreWifiStatus();
  sendActionResponse(200, neopixelAvailable, neopixelTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", neopixelAvailable),
    jsonStringField("result", neopixelTestResult)
  });
}

void handleNeoPixelPattern() {
  if (!server.hasArg("pattern")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String pattern = server.arg("pattern");
  if (!strip) {
    String message = String(Texts::neopixel) + " - " + String(Texts::not_detected);
    sendOperationError(400, message);
    return;
  }

  neopixelPauseStatus();
  String message;
  if (pattern == "rainbow") {
    neopixelRainbow();
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::rainbow.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "blink") {
    neopixelBlink(strip->Color(255, 0, 0), 5);
    // [OPT-009]: Buffer-based message (1 vs 2 allocations)
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::blink.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "fade") {
    neopixelFade(strip->Color(0, 0, 255));
    // [OPT-009]: Buffer-based message (1 vs 2 allocations)
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::fade.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "chase") {
    neopixelChase();
    char msgBuf[96];
    snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::chase.str().c_str(), Texts::ok.str().c_str());
    message = String(msgBuf);
  } else if (pattern == "off") {
    strip->clear();
    strip->show();
    neopixelTested = false;
    message = String(Texts::off);
  } else {
    sendOperationError(400, Texts::configuration_invalid.str());
    neopixelRestoreWifiStatus();
    return;
  }

  neopixelRestoreWifiStatus();
  sendOperationSuccess(message);
}

void handleNeoPixelColor() {
  if (!server.hasArg("r") || !server.hasArg("g") || !server.hasArg("b") || !strip) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  int r = server.arg("r").toInt();
  int g = server.arg("g").toInt();
  int b = server.arg("b").toInt();

  strip->fill(strip->Color(r, g, b));
  strip->show();
  neopixelTested = false;

  String message = "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")";
  sendOperationSuccess(message);
}

void handleOLEDConfig() {
  if (server.hasArg("sda") && server.hasArg("scl") && server.hasArg("rotation")) {
    int newSDA = server.arg("sda").toInt();
    int newSCL = server.arg("scl").toInt();
    int newRotation = server.arg("rotation").toInt();
    
    // Optional resolution parameters
    int newWidth = server.hasArg("width") ? server.arg("width").toInt() : oledWidth;
    int newHeight = server.hasArg("height") ? server.arg("height").toInt() : oledHeight;

    if (newSDA >= 0 && newSDA <= 48 && newSCL >= 0 && newSCL <= 48 && newRotation >= 0 && newRotation <= 3) {
      bool pinsChanged = (i2c_sda != newSDA) || (i2c_scl != newSCL);
      bool rotationChanged = (oledRotation != static_cast<uint8_t>(newRotation));
      bool resolutionChanged = (oledWidth != newWidth) || (oledHeight != newHeight);

      i2c_sda = newSDA;
      i2c_scl = newSCL;
      oledRotation = static_cast<uint8_t>(newRotation);
      oledWidth = newWidth;
      oledHeight = newHeight;

      if (pinsChanged || rotationChanged || resolutionChanged) {
        resetOLEDTest();
        Wire.end();
        detectOLED();
      } else if (oledAvailable) {
        applyOLEDOrientation();
      }

      // [OPT-007]: Buffer-based message formatting to reduce allocations (1 vs 9)
      char messageBuffer[128];
      snprintf(messageBuffer, sizeof(messageBuffer), "I2C reconfigure: SDA:%d SCL:%d Rot:%d Res:%dx%d",
               i2c_sda, i2c_scl, oledRotation, oledWidth, oledHeight);
      sendOperationSuccess(String(messageBuffer), {
        jsonNumberField("sda", i2c_sda),
        jsonNumberField("scl", i2c_scl),
        jsonNumberField("rotation", oledRotation),
        jsonNumberField("width", oledWidth),
        jsonNumberField("height", oledHeight)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
}

void handleOLEDTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(oledTestRunner, runOledTestTask, alreadyRunning, 6144, 1);

  if (started) {
    sendActionResponse(202, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

