morfredus/ESP32-Diagnostic/src/main.cpp
  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  resetOLEDTest();
  testOLED();
  sendActionResponse(200, oledAvailable, oledTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", oledAvailable),
    jsonStringField("result", oledTestResult)
  });
}

void handleOLEDStep() {
  if (!server.hasArg("step")) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String stepId = server.arg("step");

  if (!oledAvailable) {
    sendActionResponse(200, false, Texts::oled_step_unavailable.str());
    return;
  }

  bool ok = performOLEDStep(stepId);
  if (!ok) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String label = getOLEDStepLabel(stepId);
  // [OPT-007]: Buffer-based message formatting (1 vs 2 allocations)
  char msgBuf[256];
  snprintf(msgBuf, sizeof(msgBuf), "%s %s", Texts::oled_step_executed_prefix.str().c_str(), label.c_str());
  sendOperationSuccess(String(msgBuf));
}

void handleOLEDMessage() {
  if (!server.hasArg("message")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String message = server.arg("message");
  oledShowMessage(message);
  // Use translation key instead of hardcoded string
  sendOperationSuccess(Texts::message_displayed.str());
}

void handleOLEDBoot() {
  if (!oledAvailable) {
    sendActionResponse(200, false, "OLED not available");
    return;
  }

  oledShowWiFiStatus(PROJECT_NAME, "System Ready", WiFi.localIP().toString(), 100);
  sendOperationSuccess("Boot screen displayed");
}

void handleTFTTest() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available", {
      jsonBoolField("available", false)
    });
    return;
  }

  testTFT();
  sendActionResponse(200, true, "TFT test complete", {
    jsonBoolField("available", true)
  });
#else
  sendActionResponse(200, false, "TFT not enabled", {
    jsonBoolField("available", false)
  });
#endif
}

void handleTFTStep() {
#if ENABLE_TFT_DISPLAY
  if (!server.hasArg("step")) {
    sendOperationError(400, "Step parameter missing");
    return;
  }

  String stepId = server.arg("step");

  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available");
    return;
  }

  bool ok = performTFTStep(stepId);
  if (!ok) {
    sendOperationError(400, "Unknown TFT step");
    return;
  }

  String label = getTFTStepLabel(stepId);
  String message = "Step executed: " + label;
  sendOperationSuccess(message);
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleTFTBoot() {
#if ENABLE_TFT_DISPLAY
  if (!tftAvailable) {
    sendActionResponse(200, false, "TFT not available");
    return;
  }

  displayBootSplash();
  
  // Display WiFi info if connected
  if (WiFi.status() == WL_CONNECTED) {
    displayWiFiConnected(WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
  } else {
    displayWiFiStatus("WiFi not connected", TFT_ORANGE);
  }
  
  sendOperationSuccess("Boot screen displayed");
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleTFTConfig() {
#if ENABLE_TFT_DISPLAY
  // Check for required parameters
  if (server.hasArg("mosi") && server.hasArg("sclk") && server.hasArg("cs") && 
      server.hasArg("dc") && server.hasArg("rst")) {
    
    int newMOSI = server.arg("mosi").toInt();
    int newSCLK = server.arg("sclk").toInt();
    int newCS = server.arg("cs").toInt();
    int newDC = server.arg("dc").toInt();
    int newRST = server.arg("rst").toInt();
    
    // Optional parameters
    int newBL = server.hasArg("bl") ? server.arg("bl").toInt() : tftBL;
    int newWidth = server.hasArg("width") ? server.arg("width").toInt() : tftWidth;
    int newHeight = server.hasArg("height") ? server.arg("height").toInt() : tftHeight;
    int newRotation = server.hasArg("rotation") ? server.arg("rotation").toInt() : tftRotation;

    // Validate pin ranges
    if (newMOSI >= 0 && newMOSI <= 48 && newSCLK >= 0 && newSCLK <= 48 &&
        newCS >= 0 && newCS <= 48 && newDC >= 0 && newDC <= 48 && 
        newRST >= -1 && newRST <= 48 && newBL >= -1 && newBL <= 48 &&
        newRotation >= 0 && newRotation <= 3) {
      
      // Update configuration
      tftMOSI = newMOSI;
      tftSCLK = newSCLK;
      tftCS = newCS;
      tftDC = newDC;
      tftRST = newRST;
      tftBL = newBL;
      tftWidth = newWidth;
      tftHeight = newHeight;
      tftRotation = newRotation;

      // Reinitialize TFT with new settings
      tftAvailable = false;
      // Note: Complete reinitialization would require SPI reconfiguration
      // For now, we just store the values for next reboot
      
      String message = "TFT config updated: MOSI:" + String(tftMOSI) + " SCLK:" + String(tftSCLK) + 
                       " CS:" + String(tftCS) + " DC:" + String(tftDC) + " RST:" + String(tftRST) +
                       " Res:" + String(tftWidth) + "x" + String(tftHeight) + " Rot:" + String(tftRotation);
      
      sendOperationSuccess(message, {
        jsonNumberField("mosi", tftMOSI),
        jsonNumberField("sclk", tftSCLK),
        jsonNumberField("cs", tftCS),
        jsonNumberField("dc", tftDC),
        jsonNumberField("rst", tftRST),
        jsonNumberField("bl", tftBL),
        jsonNumberField("width", tftWidth),
        jsonNumberField("height", tftHeight),
        jsonNumberField("rotation", tftRotation)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
#else
  sendActionResponse(200, false, "TFT not enabled");
#endif
}

void handleADCTest() {
  testADC();
  String json;
  json.reserve(adcReadings.size() * 60 + 50);  // Estimate size to avoid reallocations
  json = "{\"readings\":[";
  for (size_t i = 0; i < adcReadings.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"pin\":" + String(adcReadings[i].pin) + ",\"raw\":" + String(adcReadings[i].rawValue) +
            ",\"voltage\":" + String(adcReadings[i].voltage, 2) + "}";
  }
  json += "],\"result\":\"" + adcTestResult + "\"}";
  server.send(200, "application/json", json);
}

void handlePWMTest() {
  testPWM();
  sendJsonResponse(200, { jsonStringField("result", pwmTestResult) });
}

void handleSPIScan() {
  scanSPI();
  sendJsonResponse(200, { jsonStringField("info", spiInfo) });
}

void handlePartitionsList() {
  listPartitions();
  sendJsonResponse(200, { jsonStringField("partitions", partitionsInfo) });
}

void handleStressTest() {
  memoryStressTest();
  sendJsonResponse(200, {
    jsonStringField("result", stressTestResult),
    jsonNumberField("allocations", static_cast<unsigned long>(stressAllocationCount)),
    jsonNumberField("durationMs", stressDurationMs),
    jsonStringField("allocationsLabel", stressTestResult)
  });
}

