morfredus/ESP32-Diagnostic/src/main.cpp
  // Note: SD.format() is not available in standard SD library
  // This would require FS.h and proper implementation
  sendJsonResponse(200, {
    jsonBoolField("success", true),
    jsonStringField("message", "Format function not implemented yet")
  });
}

// Rotary Encoder Handlers
void handleEncoderRead() {
  String json;
  json.reserve(150);
  json = "{";
  json += "\"position\":" + String(encoderPosition) + ",";
  json += "\"buttonPressed\":" + String(encoderButtonPressed ? "true" : "false");
  json += "}";

  server.send(200, "application/json", json);
}

void handleEncoderReset() {
  resetEncoderPosition();
  sendJsonResponse(200, {
    jsonBoolField("success", true),
    jsonNumberField("position", String(encoderPosition))
  });
}

void handleEncoderConfig() {
  if (server.hasArg("clk")) encoder_clk = server.arg("clk").toInt();
  if (server.hasArg("dt")) encoder_dt = server.arg("dt").toInt();
  if (server.hasArg("sw")) encoder_sw = server.arg("sw").toInt();

  sendJsonResponse(200, {
    jsonBoolField("success", true),
    jsonNumberField("clk", String(encoder_clk)),
    jsonNumberField("dt", String(encoder_dt)),
    jsonNumberField("sw", String(encoder_sw))
  });
}

// GPS Handlers
void handleGPSData() {
  updateGPS();
  String json;
  json.reserve(400);
  json = "{";
  json += "\"valid\":" + String(gpsData.valid ? "true" : "false") + ",";
  json += "\"hasFix\":" + String(gpsData.hasFix ? "true" : "false") + ",";
  json += "\"latitude\":" + String(gpsData.latitude, 6) + ",";
  json += "\"longitude\":" + String(gpsData.longitude, 6) + ",";
  json += "\"altitude\":" + String(gpsData.altitude, 2) + ",";
  json += "\"satellites\":" + String(gpsData.satellites) + ",";
  json += "\"satellites_used\":" + String(gpsData.satellites_used) + ",";
  json += "\"hdop\":" + String(gpsData.hdop, 2) + ",";
  json += "\"speed\":" + String(gpsData.speed, 2) + ",";
  json += "\"course\":" + String(gpsData.course, 2) + ",";
  json += "\"fix_type\":\"" + gpsData.fix_type + "\",";
  json += "\"status\":\"" + gpsData.status_str + "\",";
  json += "\"time\":\"" + String(gpsData.hour) + ":" + String(gpsData.minute) + ":" + String(gpsData.second) + "\",";
  json += "\"date\":\"" + String(gpsData.day) + "/" + String(gpsData.month) + "/" + String(gpsData.year) + "\"";
  json += "}";
  
  server.send(200, "application/json", json);
}

void handleGPSTest() {
  testGPS();
  String json;
  json.reserve(200);
  json = "{";
  json += "\"success\":" + String(gpsAvailable ? "true" : "false") + ",";
  json += "\"result\":\"" + gpsTestResult + "\",";
  json += "\"available\":" + String(gpsAvailable ? "true" : "false");
  json += "}";
  
  server.send(200, "application/json", json);
}

// Environmental Sensors Handlers
void handleEnvironmentalSensors() {
  updateEnvironmentalSensors();
  String json;
  json.reserve(400);
  json = "{";
  json += "\"aht20_available\":" + String(envData.aht20_available ? "true" : "false") + ",";
  json += "\"bmp280_available\":" + String(envData.bmp280_available ? "true" : "false") + ",";
  json += "\"temperature_avg\":" + String(envData.temperature_avg, 1) + ",";
  json += "\"humidity\":" + String(envData.humidity, 1) + ",";
  json += "\"pressure\":" + String(envData.pressure, 2) + ",";
  json += "\"altitude\":" + String(envData.altitude, 1) + ",";
  json += "\"aht20_temp\":" + String(envData.temperature_aht20, 1) + ",";
  json += "\"bmp280_temp\":" + String(envData.temperature_bmp280, 1) + ",";
  json += "\"aht20_status\":\"" + envData.aht20_status + "\",";
  json += "\"bmp280_status\":\"" + envData.bmp280_status + "\",";
  json += "\"combined_status\":\"" + envData.combined_status + "\"";
  json += "}";
  
  server.send(200, "application/json", json);
}

void handleEnvironmentalTest() {
  testEnvironmentalSensors();
  String json;
  json.reserve(200);
  json = "{";
  json += "\"success\":" + String(envSensorAvailable ? "true" : "false") + ",";
  json += "\"result\":\"" + envSensorTestResult + "\",";
  json += "\"available\":" + String(envSensorAvailable ? "true" : "false");
  json += "}";
  
  server.send(200, "application/json", json);
}

void handleBenchmark() {
  unsigned long cpuTime = benchmarkCPU();
  unsigned long memTime = benchmarkMemory();

  diagnosticData.cpuBenchmark = cpuTime;
  diagnosticData.memBenchmark = memTime;

  // Provide derived benchmark metrics for richer telemetry
  // Combined memory stress metrics for the benchmark API
  memoryStressTest();

  double cpuPerf = 100000.0 / static_cast<double>(cpuTime);
  double memSpeed = (10000.0 * sizeof(int) * 2.0) / static_cast<double>(memTime);
  sendJsonResponse(200, {
    jsonNumberField("cpu", cpuTime),
    jsonNumberField("memory", memTime),
    jsonFloatField("cpuPerf", cpuPerf, 2),
    jsonFloatField("memSpeed", memSpeed, 2),
    jsonNumberField("allocations", static_cast<unsigned long>(stressAllocationCount)),
    jsonNumberField("stressDuration", stressDurationMs),
    jsonStringField("stress", stressTestResult),
    jsonStringField("allocationsLabel", stressTestResult)
  });
}

void handleStatus() {
  collectDiagnosticInfo();
  collectDetailedMemory();

  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  unsigned long currentUptime = millis();

  String json;
  json.reserve(400);
  json = "{";
  json += "\"connected\":" + String(wifiConnected ? "true" : "false") + ",";
  json += "\"uptime\":" + String(currentUptime) + ",";
  json += "\"temperature\":" + String(diagnosticData.temperature) + ",";
  json += "\"sram\":{\"total\":" + String(detailedMemory.sramTotal) +
          ",\"free\":" + String(detailedMemory.sramFree) +
          ",\"used\":" + String(detailedMemory.sramUsed) + "},";
  json += "\"psram\":{\"total\":" + String(detailedMemory.psramTotal) +
          ",\"free\":" + String(detailedMemory.psramFree) +
          ",\"used\":" + String(detailedMemory.psramUsed) + "},";
  json += "\"fragmentation\":" + String(detailedMemory.fragmentationPercent, 1) + "";
  json += "}";

  server.send(200, "application/json", json);
}

void handleSystemInfo() {
  collectDiagnosticInfo();
  String json;
  json.reserve(600);
  json = "{";
  json += "\"chipModel\":\"" + diagnosticData.chipModel + "\",";
  json += "\"chipRevision\":\"" + diagnosticData.chipRevision + "\",";
  json += "\"cpuCores\":" + String(diagnosticData.cpuCores) + ",";
  json += "\"cpuFreq\":" + String(diagnosticData.cpuFreqMHz) + ",";
  json += "\"macAddress\":\"" + diagnosticData.macAddress + "\",";
  json += "\"ipAddress\":\"" + diagnosticData.ipAddress + "\",";
  json += "\"mdnsReady\":" + String(diagnosticData.mdnsAvailable ? "true" : "false") + ",";
  json += "\"uptime\":" + String(diagnosticData.uptime);
  if (diagnosticData.temperature != -999) {
    json += ",\"temperature\":" + String(diagnosticData.temperature, 1);
  }
  json += "}";
  server.send(200, "application/json", json);
}

void handleMemory() {
  collectDetailedMemory();
  String json;
  json.reserve(500);
  json = "{";
  json += "\"heap\":{\"total\":" + String(diagnosticData.heapSize) +
          ",\"free\":" + String(diagnosticData.freeHeap) +
          ",\"used\":" + String(diagnosticData.heapSize - diagnosticData.freeHeap) + "},";
  json += "\"psram\":{\"total\":" + String(detailedMemory.psramTotal) +
          ",\"free\":" + String(detailedMemory.psramFree) +
          ",\"used\":" + String(detailedMemory.psramUsed) + "},";
  json += "\"fragmentation\":" + String(detailedMemory.fragmentationPercent, 1);
  json += "}";
  server.send(200, "application/json", json);
}

